FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/CrossWorks/include/LPC1752.h
#define NVIC_IPR6 (*(volatile unsigned *)0xE000E418)
#define Irq_24_to_27_Priority NVIC_IPR6
#define NVIC_IPR6_OFFSET 0x318
#define Irq_24_to_27_Priority_OFFSET NVIC_IPR6_OFFSET
#define NVIC_IPR6_PRI_24_MASK 0xFF
#define Irq_24_to_27_Priority_PRI_24_MASK NVIC_IPR6_PRI_24_MASK
#define NVIC_IPR6_PRI_24_BIT 0
#define Irq_24_to_27_Priority_PRI_24_BIT NVIC_IPR6_PRI_24_BIT
#define NVIC_IPR6_PRI_25_MASK 0xFF00
#define Irq_24_to_27_Priority_PRI_25_MASK NVIC_IPR6_PRI_25_MASK
#define NVIC_IPR6_PRI_25_BIT 8
#define Irq_24_to_27_Priority_PRI_25_BIT NVIC_IPR6_PRI_25_BIT
#define NVIC_IPR6_PRI_26_MASK 0xFF0000
#define Irq_24_to_27_Priority_PRI_26_MASK NVIC_IPR6_PRI_26_MASK
#define NVIC_IPR6_PRI_26_BIT 16
#define Irq_24_to_27_Priority_PRI_26_BIT NVIC_IPR6_PRI_26_BIT
#define NVIC_IPR6_PRI_27_MASK 0xFF000000
#define Irq_24_to_27_Priority_PRI_27_MASK NVIC_IPR6_PRI_27_MASK
#define NVIC_IPR6_PRI_27_BIT 24
#define Irq_24_to_27_Priority_PRI_27_BIT NVIC_IPR6_PRI_27_BIT

#define NVIC_IPR7 (*(volatile unsigned *)0xE000E41C)
#define Irq_28_to_31_Priority NVIC_IPR7
#define NVIC_IPR7_OFFSET 0x31C
#define Irq_28_to_31_Priority_OFFSET NVIC_IPR7_OFFSET
#define NVIC_IPR7_PRI_28_MASK 0xFF
#define Irq_28_to_31_Priority_PRI_28_MASK NVIC_IPR7_PRI_28_MASK
#define NVIC_IPR7_PRI_28_BIT 0
#define Irq_28_to_31_Priority_PRI_28_BIT NVIC_IPR7_PRI_28_BIT
#define NVIC_IPR7_PRI_29_MASK 0xFF00
#define Irq_28_to_31_Priority_PRI_29_MASK NVIC_IPR7_PRI_29_MASK
#define NVIC_IPR7_PRI_29_BIT 8
#define Irq_28_to_31_Priority_PRI_29_BIT NVIC_IPR7_PRI_29_BIT
#define NVIC_IPR7_PRI_30_MASK 0xFF0000
#define Irq_28_to_31_Priority_PRI_30_MASK NVIC_IPR7_PRI_30_MASK
#define NVIC_IPR7_PRI_30_BIT 16
#define Irq_28_to_31_Priority_PRI_30_BIT NVIC_IPR7_PRI_30_BIT
#define NVIC_IPR7_PRI_31_MASK 0xFF000000
#define Irq_28_to_31_Priority_PRI_31_MASK NVIC_IPR7_PRI_31_MASK
#define NVIC_IPR7_PRI_31_BIT 24
#define Irq_28_to_31_Priority_PRI_31_BIT NVIC_IPR7_PRI_31_BIT

#define NVIC_IPR8 (*(volatile unsigned *)0xE000E420)
#define Irq_32_to_35_Priority NVIC_IPR8
#define NVIC_IPR8_OFFSET 0x320
#define Irq_32_to_35_Priority_OFFSET NVIC_IPR8_OFFSET
#define NVIC_IPR8_PRI_32_MASK 0xFF
#define Irq_32_to_35_Priority_PRI_32_MASK NVIC_IPR8_PRI_32_MASK
#define NVIC_IPR8_PRI_32_BIT 0
#define Irq_32_to_35_Priority_PRI_32_BIT NVIC_IPR8_PRI_32_BIT
#define NVIC_IPR8_PRI_33_MASK 0xFF00
#define Irq_32_to_35_Priority_PRI_33_MASK NVIC_IPR8_PRI_33_MASK
#define NVIC_IPR8_PRI_33_BIT 8
#define Irq_32_to_35_Priority_PRI_33_BIT NVIC_IPR8_PRI_33_BIT
#define NVIC_IPR8_PRI_34_MASK 0xFF0000
#define Irq_32_to_35_Priority_PRI_34_MASK NVIC_IPR8_PRI_34_MASK
#define NVIC_IPR8_PRI_34_BIT 16
#define Irq_32_to_35_Priority_PRI_34_BIT NVIC_IPR8_PRI_34_BIT
#define NVIC_IPR8_PRI_35_MASK 0xFF000000
#define Irq_32_to_35_Priority_PRI_35_MASK NVIC_IPR8_PRI_35_MASK
#define NVIC_IPR8_PRI_35_BIT 24
#define Irq_32_to_35_Priority_PRI_35_BIT NVIC_IPR8_PRI_35_BIT

#define NVIC_IPR9 (*(volatile unsigned *)0xE000E424)
#define Irq_36_to_39_Priority NVIC_IPR9
#define NVIC_IPR9_OFFSET 0x324
#define Irq_36_to_39_Priority_OFFSET NVIC_IPR9_OFFSET
#define NVIC_IPR9_PRI_36_MASK 0xFF
#define Irq_36_to_39_Priority_PRI_36_MASK NVIC_IPR9_PRI_36_MASK
#define NVIC_IPR9_PRI_36_BIT 0
#define Irq_36_to_39_Priority_PRI_36_BIT NVIC_IPR9_PRI_36_BIT
#define NVIC_IPR9_PRI_37_MASK 0xFF00
#define Irq_36_to_39_Priority_PRI_37_MASK NVIC_IPR9_PRI_37_MASK
#define NVIC_IPR9_PRI_37_BIT 8
#define Irq_36_to_39_Priority_PRI_37_BIT NVIC_IPR9_PRI_37_BIT
#define NVIC_IPR9_PRI_38_MASK 0xFF0000
#define Irq_36_to_39_Priority_PRI_38_MASK NVIC_IPR9_PRI_38_MASK
#define NVIC_IPR9_PRI_38_BIT 16
#define Irq_36_to_39_Priority_PRI_38_BIT NVIC_IPR9_PRI_38_BIT
#define NVIC_IPR9_PRI_39_MASK 0xFF000000
#define Irq_36_to_39_Priority_PRI_39_MASK NVIC_IPR9_PRI_39_MASK
#define NVIC_IPR9_PRI_39_BIT 24
#define Irq_36_to_39_Priority_PRI_39_BIT NVIC_IPR9_PRI_39_BIT

#define NVIC_IPR10 (*(volatile unsigned *)0xE000E428)
#define Irq_40_to_43_Priority NVIC_IPR10
#define NVIC_IPR10_OFFSET 0x328
#define Irq_40_to_43_Priority_OFFSET NVIC_IPR10_OFFSET
#define NVIC_IPR10_PRI_40_MASK 0xFF
#define Irq_40_to_43_Priority_PRI_40_MASK NVIC_IPR10_PRI_40_MASK
#define NVIC_IPR10_PRI_40_BIT 0
#define Irq_40_to_43_Priority_PRI_40_BIT NVIC_IPR10_PRI_40_BIT
#define NVIC_IPR10_PRI_41_MASK 0xFF00
#define Irq_40_to_43_Priority_PRI_41_MASK NVIC_IPR10_PRI_41_MASK
#define NVIC_IPR10_PRI_41_BIT 8
#define Irq_40_to_43_Priority_PRI_41_BIT NVIC_IPR10_PRI_41_BIT
#define NVIC_IPR10_PRI_42_MASK 0xFF0000
#define Irq_40_to_43_Priority_PRI_42_MASK NVIC_IPR10_PRI_42_MASK
#define NVIC_IPR10_PRI_42_BIT 16
#define Irq_40_to_43_Priority_PRI_42_BIT NVIC_IPR10_PRI_42_BIT
#define NVIC_IPR10_PRI_43_MASK 0xFF000000
#define Irq_40_to_43_Priority_PRI_43_MASK NVIC_IPR10_PRI_43_MASK
#define NVIC_IPR10_PRI_43_BIT 24
#define Irq_40_to_43_Priority_PRI_43_BIT NVIC_IPR10_PRI_43_BIT

#define NVIC_IPR11 (*(volatile unsigned *)0xE000E42C)
#define Irq_44_to_47_Priority NVIC_IPR11
#define NVIC_IPR11_OFFSET 0x32C
#define Irq_44_to_47_Priority_OFFSET NVIC_IPR11_OFFSET
#define NVIC_IPR11_PRI_44_MASK 0xFF
#define Irq_44_to_47_Priority_PRI_44_MASK NVIC_IPR11_PRI_44_MASK
#define NVIC_IPR11_PRI_44_BIT 0
#define Irq_44_to_47_Priority_PRI_44_BIT NVIC_IPR11_PRI_44_BIT
#define NVIC_IPR11_PRI_45_MASK 0xFF00
#define Irq_44_to_47_Priority_PRI_45_MASK NVIC_IPR11_PRI_45_MASK
#define NVIC_IPR11_PRI_45_BIT 8
#define Irq_44_to_47_Priority_PRI_45_BIT NVIC_IPR11_PRI_45_BIT
#define NVIC_IPR11_PRI_46_MASK 0xFF0000
#define Irq_44_to_47_Priority_PRI_46_MASK NVIC_IPR11_PRI_46_MASK
#define NVIC_IPR11_PRI_46_BIT 16
#define Irq_44_to_47_Priority_PRI_46_BIT NVIC_IPR11_PRI_46_BIT
#define NVIC_IPR11_PRI_47_MASK 0xFF000000
#define Irq_44_to_47_Priority_PRI_47_MASK NVIC_IPR11_PRI_47_MASK
#define NVIC_IPR11_PRI_47_BIT 24
#define Irq_44_to_47_Priority_PRI_47_BIT NVIC_IPR11_PRI_47_BIT

#define NVIC_IPR12 (*(volatile unsigned *)0xE000E430)
#define Irq_48_to_51_Priority NVIC_IPR12
#define NVIC_IPR12_OFFSET 0x330
#define Irq_48_to_51_Priority_OFFSET NVIC_IPR12_OFFSET
#define NVIC_IPR12_PRI_48_MASK 0xFF
#define Irq_48_to_51_Priority_PRI_48_MASK NVIC_IPR12_PRI_48_MASK
#define NVIC_IPR12_PRI_48_BIT 0
#define Irq_48_to_51_Priority_PRI_48_BIT NVIC_IPR12_PRI_48_BIT
#define NVIC_IPR12_PRI_49_MASK 0xFF00
#define Irq_48_to_51_Priority_PRI_49_MASK NVIC_IPR12_PRI_49_MASK
#define NVIC_IPR12_PRI_49_BIT 8
#define Irq_48_to_51_Priority_PRI_49_BIT NVIC_IPR12_PRI_49_BIT
#define NVIC_IPR12_PRI_50_MASK 0xFF0000
#define Irq_48_to_51_Priority_PRI_50_MASK NVIC_IPR12_PRI_50_MASK
#define NVIC_IPR12_PRI_50_BIT 16
#define Irq_48_to_51_Priority_PRI_50_BIT NVIC_IPR12_PRI_50_BIT
#define NVIC_IPR12_PRI_51_MASK 0xFF000000
#define Irq_48_to_51_Priority_PRI_51_MASK NVIC_IPR12_PRI_51_MASK
#define NVIC_IPR12_PRI_51_BIT 24
#define Irq_48_to_51_Priority_PRI_51_BIT NVIC_IPR12_PRI_51_BIT

