FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/CrossWorks/include/LPC1752.h
#define NVIC_IPR20 (*(volatile unsigned *)0xE000E450)
#define Irq_80_to_83_Priority NVIC_IPR20
#define NVIC_IPR20_OFFSET 0x350
#define Irq_80_to_83_Priority_OFFSET NVIC_IPR20_OFFSET
#define NVIC_IPR20_PRI_80_MASK 0xFF
#define Irq_80_to_83_Priority_PRI_80_MASK NVIC_IPR20_PRI_80_MASK
#define NVIC_IPR20_PRI_80_BIT 0
#define Irq_80_to_83_Priority_PRI_80_BIT NVIC_IPR20_PRI_80_BIT
#define NVIC_IPR20_PRI_81_MASK 0xFF00
#define Irq_80_to_83_Priority_PRI_81_MASK NVIC_IPR20_PRI_81_MASK
#define NVIC_IPR20_PRI_81_BIT 8
#define Irq_80_to_83_Priority_PRI_81_BIT NVIC_IPR20_PRI_81_BIT
#define NVIC_IPR20_PRI_82_MASK 0xFF0000
#define Irq_80_to_83_Priority_PRI_82_MASK NVIC_IPR20_PRI_82_MASK
#define NVIC_IPR20_PRI_82_BIT 16
#define Irq_80_to_83_Priority_PRI_82_BIT NVIC_IPR20_PRI_82_BIT
#define NVIC_IPR20_PRI_83_MASK 0xFF000000
#define Irq_80_to_83_Priority_PRI_83_MASK NVIC_IPR20_PRI_83_MASK
#define NVIC_IPR20_PRI_83_BIT 24
#define Irq_80_to_83_Priority_PRI_83_BIT NVIC_IPR20_PRI_83_BIT

#define NVIC_IPR21 (*(volatile unsigned *)0xE000E454)
#define Irq_84_to_87_Priority NVIC_IPR21
#define NVIC_IPR21_OFFSET 0x354
#define Irq_84_to_87_Priority_OFFSET NVIC_IPR21_OFFSET
#define NVIC_IPR21_PRI_84_MASK 0xFF
#define Irq_84_to_87_Priority_PRI_84_MASK NVIC_IPR21_PRI_84_MASK
#define NVIC_IPR21_PRI_84_BIT 0
#define Irq_84_to_87_Priority_PRI_84_BIT NVIC_IPR21_PRI_84_BIT
#define NVIC_IPR21_PRI_85_MASK 0xFF00
#define Irq_84_to_87_Priority_PRI_85_MASK NVIC_IPR21_PRI_85_MASK
#define NVIC_IPR21_PRI_85_BIT 8
#define Irq_84_to_87_Priority_PRI_85_BIT NVIC_IPR21_PRI_85_BIT
#define NVIC_IPR21_PRI_86_MASK 0xFF0000
#define Irq_84_to_87_Priority_PRI_86_MASK NVIC_IPR21_PRI_86_MASK
#define NVIC_IPR21_PRI_86_BIT 16
#define Irq_84_to_87_Priority_PRI_86_BIT NVIC_IPR21_PRI_86_BIT
#define NVIC_IPR21_PRI_87_MASK 0xFF000000
#define Irq_84_to_87_Priority_PRI_87_MASK NVIC_IPR21_PRI_87_MASK
#define NVIC_IPR21_PRI_87_BIT 24
#define Irq_84_to_87_Priority_PRI_87_BIT NVIC_IPR21_PRI_87_BIT

#define NVIC_IPR22 (*(volatile unsigned *)0xE000E458)
#define Irq_88_to_91_Priority NVIC_IPR22
#define NVIC_IPR22_OFFSET 0x358
#define Irq_88_to_91_Priority_OFFSET NVIC_IPR22_OFFSET
#define NVIC_IPR22_PRI_88_MASK 0xFF
#define Irq_88_to_91_Priority_PRI_88_MASK NVIC_IPR22_PRI_88_MASK
#define NVIC_IPR22_PRI_88_BIT 0
#define Irq_88_to_91_Priority_PRI_88_BIT NVIC_IPR22_PRI_88_BIT
#define NVIC_IPR22_PRI_89_MASK 0xFF00
#define Irq_88_to_91_Priority_PRI_89_MASK NVIC_IPR22_PRI_89_MASK
#define NVIC_IPR22_PRI_89_BIT 8
#define Irq_88_to_91_Priority_PRI_89_BIT NVIC_IPR22_PRI_89_BIT
#define NVIC_IPR22_PRI_90_MASK 0xFF0000
#define Irq_88_to_91_Priority_PRI_90_MASK NVIC_IPR22_PRI_90_MASK
#define NVIC_IPR22_PRI_90_BIT 16
#define Irq_88_to_91_Priority_PRI_90_BIT NVIC_IPR22_PRI_90_BIT
#define NVIC_IPR22_PRI_91_MASK 0xFF000000
#define Irq_88_to_91_Priority_PRI_91_MASK NVIC_IPR22_PRI_91_MASK
#define NVIC_IPR22_PRI_91_BIT 24
#define Irq_88_to_91_Priority_PRI_91_BIT NVIC_IPR22_PRI_91_BIT

#define NVIC_IPR23 (*(volatile unsigned *)0xE000E45C)
#define Irq_92_to_95_Priority NVIC_IPR23
#define NVIC_IPR23_OFFSET 0x35C
#define Irq_92_to_95_Priority_OFFSET NVIC_IPR23_OFFSET
#define NVIC_IPR23_PRI_92_MASK 0xFF
#define Irq_92_to_95_Priority_PRI_92_MASK NVIC_IPR23_PRI_92_MASK
#define NVIC_IPR23_PRI_92_BIT 0
#define Irq_92_to_95_Priority_PRI_92_BIT NVIC_IPR23_PRI_92_BIT
#define NVIC_IPR23_PRI_93_MASK 0xFF00
#define Irq_92_to_95_Priority_PRI_93_MASK NVIC_IPR23_PRI_93_MASK
#define NVIC_IPR23_PRI_93_BIT 8
#define Irq_92_to_95_Priority_PRI_93_BIT NVIC_IPR23_PRI_93_BIT
#define NVIC_IPR23_PRI_94_MASK 0xFF0000
#define Irq_92_to_95_Priority_PRI_94_MASK NVIC_IPR23_PRI_94_MASK
#define NVIC_IPR23_PRI_94_BIT 16
#define Irq_92_to_95_Priority_PRI_94_BIT NVIC_IPR23_PRI_94_BIT
#define NVIC_IPR23_PRI_95_MASK 0xFF000000
#define Irq_92_to_95_Priority_PRI_95_MASK NVIC_IPR23_PRI_95_MASK
#define NVIC_IPR23_PRI_95_BIT 24
#define Irq_92_to_95_Priority_PRI_95_BIT NVIC_IPR23_PRI_95_BIT

#define NVIC_IPR24 (*(volatile unsigned *)0xE000E460)
#define Irq_96_to_99_Priority NVIC_IPR24
#define NVIC_IPR24_OFFSET 0x360
#define Irq_96_to_99_Priority_OFFSET NVIC_IPR24_OFFSET
#define NVIC_IPR24_PRI_96_MASK 0xFF
#define Irq_96_to_99_Priority_PRI_96_MASK NVIC_IPR24_PRI_96_MASK
#define NVIC_IPR24_PRI_96_BIT 0
#define Irq_96_to_99_Priority_PRI_96_BIT NVIC_IPR24_PRI_96_BIT
#define NVIC_IPR24_PRI_97_MASK 0xFF00
#define Irq_96_to_99_Priority_PRI_97_MASK NVIC_IPR24_PRI_97_MASK
#define NVIC_IPR24_PRI_97_BIT 8
#define Irq_96_to_99_Priority_PRI_97_BIT NVIC_IPR24_PRI_97_BIT
#define NVIC_IPR24_PRI_98_MASK 0xFF0000
#define Irq_96_to_99_Priority_PRI_98_MASK NVIC_IPR24_PRI_98_MASK
#define NVIC_IPR24_PRI_98_BIT 16
#define Irq_96_to_99_Priority_PRI_98_BIT NVIC_IPR24_PRI_98_BIT
#define NVIC_IPR24_PRI_99_MASK 0xFF000000
#define Irq_96_to_99_Priority_PRI_99_MASK NVIC_IPR24_PRI_99_MASK
#define NVIC_IPR24_PRI_99_BIT 24
#define Irq_96_to_99_Priority_PRI_99_BIT NVIC_IPR24_PRI_99_BIT

#define NVIC_IPR25 (*(volatile unsigned *)0xE000E464)
#define Irq_100_to_103_Priority NVIC_IPR25
#define NVIC_IPR25_OFFSET 0x364
#define Irq_100_to_103_Priority_OFFSET NVIC_IPR25_OFFSET
#define NVIC_IPR25_PRI_100_MASK 0xFF
#define Irq_100_to_103_Priority_PRI_100_MASK NVIC_IPR25_PRI_100_MASK
#define NVIC_IPR25_PRI_100_BIT 0
#define Irq_100_to_103_Priority_PRI_100_BIT NVIC_IPR25_PRI_100_BIT
#define NVIC_IPR25_PRI_101_MASK 0xFF00
#define Irq_100_to_103_Priority_PRI_101_MASK NVIC_IPR25_PRI_101_MASK
#define NVIC_IPR25_PRI_101_BIT 8
#define Irq_100_to_103_Priority_PRI_101_BIT NVIC_IPR25_PRI_101_BIT
#define NVIC_IPR25_PRI_102_MASK 0xFF0000
#define Irq_100_to_103_Priority_PRI_102_MASK NVIC_IPR25_PRI_102_MASK
#define NVIC_IPR25_PRI_102_BIT 16
#define Irq_100_to_103_Priority_PRI_102_BIT NVIC_IPR25_PRI_102_BIT
#define NVIC_IPR25_PRI_103_MASK 0xFF000000
#define Irq_100_to_103_Priority_PRI_103_MASK NVIC_IPR25_PRI_103_MASK
#define NVIC_IPR25_PRI_103_BIT 24
#define Irq_100_to_103_Priority_PRI_103_BIT NVIC_IPR25_PRI_103_BIT

#define NVIC_IPR26 (*(volatile unsigned *)0xE000E468)
#define Irq_104_to_107_Priority NVIC_IPR26
#define NVIC_IPR26_OFFSET 0x368
#define Irq_104_to_107_Priority_OFFSET NVIC_IPR26_OFFSET
#define NVIC_IPR26_PRI_104_MASK 0xFF
#define Irq_104_to_107_Priority_PRI_104_MASK NVIC_IPR26_PRI_104_MASK
#define NVIC_IPR26_PRI_104_BIT 0
#define Irq_104_to_107_Priority_PRI_104_BIT NVIC_IPR26_PRI_104_BIT
#define NVIC_IPR26_PRI_105_MASK 0xFF00
#define Irq_104_to_107_Priority_PRI_105_MASK NVIC_IPR26_PRI_105_MASK
#define NVIC_IPR26_PRI_105_BIT 8
#define Irq_104_to_107_Priority_PRI_105_BIT NVIC_IPR26_PRI_105_BIT
#define NVIC_IPR26_PRI_106_MASK 0xFF0000
#define Irq_104_to_107_Priority_PRI_106_MASK NVIC_IPR26_PRI_106_MASK
#define NVIC_IPR26_PRI_106_BIT 16
#define Irq_104_to_107_Priority_PRI_106_BIT NVIC_IPR26_PRI_106_BIT
#define NVIC_IPR26_PRI_107_MASK 0xFF000000
#define Irq_104_to_107_Priority_PRI_107_MASK NVIC_IPR26_PRI_107_MASK
#define NVIC_IPR26_PRI_107_BIT 24
#define Irq_104_to_107_Priority_PRI_107_BIT NVIC_IPR26_PRI_107_BIT

#define NVIC_IPR27 (*(volatile unsigned *)0xE000E46C)
#define Irq_108_to_111_Priority NVIC_IPR27
#define NVIC_IPR27_OFFSET 0x36C
#define Irq_108_to_111_Priority_OFFSET NVIC_IPR27_OFFSET
#define NVIC_IPR27_PRI_108_MASK 0xFF
#define Irq_108_to_111_Priority_PRI_108_MASK NVIC_IPR27_PRI_108_MASK
#define NVIC_IPR27_PRI_108_BIT 0
#define Irq_108_to_111_Priority_PRI_108_BIT NVIC_IPR27_PRI_108_BIT
#define NVIC_IPR27_PRI_109_MASK 0xFF00
#define Irq_108_to_111_Priority_PRI_109_MASK NVIC_IPR27_PRI_109_MASK
#define NVIC_IPR27_PRI_109_BIT 8
#define Irq_108_to_111_Priority_PRI_109_BIT NVIC_IPR27_PRI_109_BIT
#define NVIC_IPR27_PRI_110_MASK 0xFF0000
#define Irq_108_to_111_Priority_PRI_110_MASK NVIC_IPR27_PRI_110_MASK
#define NVIC_IPR27_PRI_110_BIT 16
#define Irq_108_to_111_Priority_PRI_110_BIT NVIC_IPR27_PRI_110_BIT
#define NVIC_IPR27_PRI_111_MASK 0xFF000000
#define Irq_108_to_111_Priority_PRI_111_MASK NVIC_IPR27_PRI_111_MASK
#define NVIC_IPR27_PRI_111_BIT 24
#define Irq_108_to_111_Priority_PRI_111_BIT NVIC_IPR27_PRI_111_BIT

#define NVIC_IP0 (*(volatile unsigned char *)0xE000E400)
#define NVIC_IP0_OFFSET 0x300

#define NVIC_IP1 (*(volatile unsigned char *)0xE000E401)
#define NVIC_IP1_OFFSET 0x301

