FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1756/CrossWorks/include/LPC1752.h
#define SCB_ISAR1 (*(volatile unsigned *)0xE000ED64)
#define ISAR1 SCB_ISAR1
#define SCB_ISAR1_OFFSET 0x64
#define ISAR1_OFFSET SCB_ISAR1_OFFSET

#define SCB_ISAR2 (*(volatile unsigned *)0xE000ED68)
#define ISAR2 SCB_ISAR2
#define SCB_ISAR2_OFFSET 0x68
#define ISAR2_OFFSET SCB_ISAR2_OFFSET

#define SCB_ISAR3 (*(volatile unsigned *)0xE000ED6C)
#define ISAR3 SCB_ISAR3
#define SCB_ISAR3_OFFSET 0x6C
#define ISAR3_OFFSET SCB_ISAR3_OFFSET

#define SCB_ISAR4 (*(volatile unsigned *)0xE000ED70)
#define ISAR4 SCB_ISAR4
#define SCB_ISAR4_OFFSET 0x70
#define ISAR4_OFFSET SCB_ISAR4_OFFSET

#define MPU_BASE_ADDRESS 0xE000ED90

#define MPU_TYPE (*(volatile unsigned *)0xE000ED90)
#define MPU_Type MPU_TYPE
#define MPU_TYPE_OFFSET 0x0
#define MPU_Type_OFFSET MPU_TYPE_OFFSET
#define MPU_TYPE_IREGION_MASK 0xFF0000
#define MPU_Type_IREGION_MASK MPU_TYPE_IREGION_MASK
#define MPU_TYPE_IREGION_BIT 16
#define MPU_Type_IREGION_BIT MPU_TYPE_IREGION_BIT
#define MPU_TYPE_DREGION_MASK 0xFF00
#define MPU_Type_DREGION_MASK MPU_TYPE_DREGION_MASK
#define MPU_TYPE_DREGION_BIT 8
#define MPU_Type_DREGION_BIT MPU_TYPE_DREGION_BIT
#define MPU_TYPE_SEPARATE_MASK 0xFF
#define MPU_Type_SEPARATE_MASK MPU_TYPE_SEPARATE_MASK
#define MPU_TYPE_SEPARATE_BIT 0
#define MPU_Type_SEPARATE_BIT MPU_TYPE_SEPARATE_BIT

#define MPU_CTRL (*(volatile unsigned *)0xE000ED94)
#define MPU_Control MPU_CTRL
#define MPU_CTRL_OFFSET 0x4
#define MPU_Control_OFFSET MPU_CTRL_OFFSET
#define MPU_CTRL_PRIVDEFENA_MASK 0x4
#define MPU_Control_PRIVDEFENA_MASK MPU_CTRL_PRIVDEFENA_MASK
#define MPU_CTRL_PRIVDEFENA 0x4
#define MPU_Control_PRIVDEFENA MPU_CTRL_PRIVDEFENA
#define MPU_CTRL_PRIVDEFENA_BIT 2
#define MPU_Control_PRIVDEFENA_BIT MPU_CTRL_PRIVDEFENA_BIT
#define MPU_CTRL_HFNMIENA_MASK 0x2
#define MPU_Control_HFNMIENA_MASK MPU_CTRL_HFNMIENA_MASK
#define MPU_CTRL_HFNMIENA 0x2
#define MPU_Control_HFNMIENA MPU_CTRL_HFNMIENA
#define MPU_CTRL_HFNMIENA_BIT 1
#define MPU_Control_HFNMIENA_BIT MPU_CTRL_HFNMIENA_BIT
#define MPU_CTRL_ENABLE_MASK 0x1
#define MPU_Control_ENABLE_MASK MPU_CTRL_ENABLE_MASK
#define MPU_CTRL_ENABLE 0x1
#define MPU_Control_ENABLE MPU_CTRL_ENABLE
#define MPU_CTRL_ENABLE_BIT 0
#define MPU_Control_ENABLE_BIT MPU_CTRL_ENABLE_BIT

#define MPU_RNR (*(volatile unsigned *)0xE000ED98)
#define MPU_Region_Number MPU_RNR
#define MPU_RNR_OFFSET 0x8
#define MPU_Region_Number_OFFSET MPU_RNR_OFFSET
#define MPU_RNR_REGION_MASK 0xFF
#define MPU_Region_Number_REGION_MASK MPU_RNR_REGION_MASK
#define MPU_RNR_REGION_BIT 0
#define MPU_Region_Number_REGION_BIT MPU_RNR_REGION_BIT

#define MPU_RBAR (*(volatile unsigned *)0xE000ED9C)
#define MPU_Region_Base_Address MPU_RBAR
#define MPU_RBAR_OFFSET 0xC
#define MPU_Region_Base_Address_OFFSET MPU_RBAR_OFFSET
#define MPU_RBAR_ADDR_MASK 0xFFFFFFE0
#define MPU_Region_Base_Address_ADDR_MASK MPU_RBAR_ADDR_MASK
#define MPU_RBAR_ADDR_BIT 5
#define MPU_Region_Base_Address_ADDR_BIT MPU_RBAR_ADDR_BIT
#define MPU_RBAR_VALID_MASK 0x10
#define MPU_Region_Base_Address_VALID_MASK MPU_RBAR_VALID_MASK
#define MPU_RBAR_VALID 0x10
#define MPU_Region_Base_Address_VALID MPU_RBAR_VALID
#define MPU_RBAR_VALID_BIT 4
#define MPU_Region_Base_Address_VALID_BIT MPU_RBAR_VALID_BIT
#define MPU_RBAR_REGION_MASK 0xF
#define MPU_Region_Base_Address_REGION_MASK MPU_RBAR_REGION_MASK
#define MPU_RBAR_REGION_BIT 0
#define MPU_Region_Base_Address_REGION_BIT MPU_RBAR_REGION_BIT

#define MPU_RASR (*(volatile unsigned *)0xE000EDA0)
#define MPU_Attribute_and_Size MPU_RASR
#define MPU_RASR_OFFSET 0x10
#define MPU_Attribute_and_Size_OFFSET MPU_RASR_OFFSET
#define MPU_RASR_XN_MASK 0x10000000
#define MPU_Attribute_and_Size_XN_MASK MPU_RASR_XN_MASK
#define MPU_RASR_XN 0x10000000
#define MPU_Attribute_and_Size_XN MPU_RASR_XN
#define MPU_RASR_XN_BIT 28
#define MPU_Attribute_and_Size_XN_BIT MPU_RASR_XN_BIT
#define MPU_RASR_AP_MASK 0x7000000
#define MPU_Attribute_and_Size_AP_MASK MPU_RASR_AP_MASK
#define MPU_RASR_AP_BIT 24
#define MPU_Attribute_and_Size_AP_BIT MPU_RASR_AP_BIT
#define MPU_RASR_TEX_MASK 0x380000
#define MPU_Attribute_and_Size_TEX_MASK MPU_RASR_TEX_MASK
#define MPU_RASR_TEX_BIT 19
#define MPU_Attribute_and_Size_TEX_BIT MPU_RASR_TEX_BIT
#define MPU_RASR_S_MASK 0x40000
#define MPU_Attribute_and_Size_S_MASK MPU_RASR_S_MASK
#define MPU_RASR_S 0x40000
#define MPU_Attribute_and_Size_S MPU_RASR_S
#define MPU_RASR_S_BIT 18
#define MPU_Attribute_and_Size_S_BIT MPU_RASR_S_BIT
#define MPU_RASR_C_MASK 0x20000
#define MPU_Attribute_and_Size_C_MASK MPU_RASR_C_MASK
#define MPU_RASR_C 0x20000
#define MPU_Attribute_and_Size_C MPU_RASR_C
#define MPU_RASR_C_BIT 17
#define MPU_Attribute_and_Size_C_BIT MPU_RASR_C_BIT
#define MPU_RASR_B_MASK 0x10000
#define MPU_Attribute_and_Size_B_MASK MPU_RASR_B_MASK
#define MPU_RASR_B 0x10000
#define MPU_Attribute_and_Size_B MPU_RASR_B
#define MPU_RASR_B_BIT 16
#define MPU_Attribute_and_Size_B_BIT MPU_RASR_B_BIT
#define MPU_RASR_SRD_MASK 0xFF00
#define MPU_Attribute_and_Size_SRD_MASK MPU_RASR_SRD_MASK
#define MPU_RASR_SRD_BIT 8
#define MPU_Attribute_and_Size_SRD_BIT MPU_RASR_SRD_BIT
#define MPU_RASR_SIZE_MASK 0x3E
#define MPU_Attribute_and_Size_SIZE_MASK MPU_RASR_SIZE_MASK
#define MPU_RASR_SIZE_BIT 1
#define MPU_Attribute_and_Size_SIZE_BIT MPU_RASR_SIZE_BIT
#define MPU_RASR_ENABLE_MASK 0x1
#define MPU_Attribute_and_Size_ENABLE_MASK MPU_RASR_ENABLE_MASK
#define MPU_RASR_ENABLE 0x1
#define MPU_Attribute_and_Size_ENABLE MPU_RASR_ENABLE
#define MPU_RASR_ENABLE_BIT 0
#define MPU_Attribute_and_Size_ENABLE_BIT MPU_RASR_ENABLE_BIT

#define CoreDebug_BASE_ADDRESS 0xE000EDF0

#define DHCSR (*(volatile unsigned *)0xE000EDF0)
#define DHCSR_OFFSET 0x0

#define DCRSR (*(volatile unsigned *)0xE000EDF4)
#define DCRSR_OFFSET 0x4

#define DCRDR (*(volatile unsigned *)0xE000EDF8)
#define DCRDR_OFFSET 0x8

#define DEMCR (*(volatile unsigned *)0xE000EDFC)
#define DEMCR_OFFSET 0xC

#define ID_space_BASE_ADDRESS 0xE000EFD0

#define PID4 (*(volatile unsigned char *)0xE000EFD0)
#define PID4_OFFSET 0x0

#define PID5 (*(volatile unsigned char *)0xE000EFD4)
#define PID5_OFFSET 0x4

#define PID6 (*(volatile unsigned char *)0xE000EFD8)
#define PID6_OFFSET 0x8

#define PID7 (*(volatile unsigned char *)0xE000EFDC)
#define PID7_OFFSET 0xC

#define PID0 (*(volatile unsigned char *)0xE000EFE0)
#define PID0_OFFSET 0x10

#define PID1 (*(volatile unsigned char *)0xE000EFE4)
#define PID1_OFFSET 0x14

#define PID2 (*(volatile unsigned char *)0xE000EFE8)
#define PID2_OFFSET 0x18

#define PID3 (*(volatile unsigned char *)0xE000EFEC)
#define PID3_OFFSET 0x1C

#define CID0 (*(volatile unsigned char *)0xE000EFF0)
#define CID0_OFFSET 0x20

#define CID1 (*(volatile unsigned char *)0xE000EFF4)
#define CID1_OFFSET 0x24

#define CID2 (*(volatile unsigned char *)0xE000EFF8)
#define CID2_OFFSET 0x28

#define CID3 (*(volatile unsigned char *)0xE000EFFC)
#define CID3_OFFSET 0x2C


#endif
